$str1 = 'Hello, ';
$str2 = "world!";
echo $str1 . true;
?>
<h2>Операции сравнения</h2>
<p> < > == != <= > </p>
<?php
$a = (5 < 5);
echo $a;
?>
<h2>Операции строгого сравнения</h2>
<p>===  !==</p>
<?php
$b = (5 == '5');
$c = (5 === '5');
echo "b = $b, c = $c";
?>
<h2>Логические операции</h2>
<p>И(&& или and) ИЛИ(|| или or) НЕ(!)<p>
<?php
$x = (true && false);
$y = (true || false);
?>
<h2>Операции присваивания</h2>
<p> = </p>
<?php
$d = 'Hello';
$e = 5;
$e += 7;
$f = 3;
$f *= $e;?>
<p> = += -= *= /= **= .= %= </p>
<h2>Приоритет операций</h2>
<p>** (++ --) ! (* / %) (+ - .) (< > <= >=) (== != ===  !==) &&  || (= += ...)</p>