<h1>Практическая работа 3 условия<h1>

<?php
echo "<h2>Задание1<h2>";

$a = 10;
$b = 5;
echo "Исходные данные: a = $a, b = $b ";
if ($a < $b) {
    $c = $a + $b;
    echo "Выводить сумму если a < b; Сумма a + b: $c";
} else {
    $c = $a * $b;
    echo "Выводить произведение если a > b; Произведение a * b: $c";
}
?>
<?php
echo "<h2>Задание2<h2>";
$ygl1 = 45;
$ygl2 = 45;
$ygl3 = 180 - ($ygl1 + $ygl2);
echo "Исходные данные: Угол 1 = {$ygl1}; Угол 2 = {$ygl2};";
echo "Третий угол = 180 - ({$ygl1} + {$ygl2}) = {$ygl3} ";
if ($ygl1 > 0 && $ygl2 > 0 && $ygl3 > 0){
    echo " Треугольник существует  ";
    if ($ygl1 == 90 || $ygl2 == 90 || $ygl3 == 90)  {
        echo " Он прямоугольный ";
    } else {
        echo " Он не прямоугольный ";
    }
}else {
    echo " Треугольника не существует ";
}
?>
<?php
echo "<h2>Задание3<h2>";
$age = 5;
$ageGroup = "";
echo " Исходные данные : Возраст кота age = {$age} лет ";
if ($age <= 1) {
    $ageGroup = " Котята ";
} elseif ($age <= 3) {
    $ageGroup = " Молодые коты ";
} elseif ($age <= 7) {
    $ageGroup = " Коты  средних лет ";
} else {
    $ageGroup = " Почетные коты ";
}
echo $ageGroup;
?>
<?php
echo "<h2>Задание4<h2>";

$a = 3;
$b = 4;
$c = 5;

if (($a + $b > $c) && ($a + $c > $b) && ($b + $c > $a)) {
    echo "Треугольник существует.</p>";
} else {
    echo "Треугольник не существует.</p>";
}
?>
<?php
echo "<h2>Задание5<h2>";
$n = 2026;
if ($n % 400 == 0) {
    echo "год високосный";
} elseif ($n % 100 == 0) {
    echo "Год не високосный";
} elseif ($n % 4 == 0) {
    echo "Год високосный";
} else {
    echo "Год не високосный";
}
?>
<?php
echo "<h2>Задание6<h2>";
$a = 20000;
$b = 20000;
$sum =  $a + $b;
echo " Исходные данные : A = {$a}, B = {$b}";
echo " Сумма = {$a} + {$b} = {$sum}"; 
echo " Порог переполнения : 32767 ";
if ($sum > 32767) {
    echo " Переполнение!" ;
} else {
    echo " Сумма : {$sum}" ;
}
?>